wegam/STM32F1xWorkSpace/Examples/WOW/AMPLCDV11.C
#ifdef AMPLCDV11

#include "AMPLCDV11.H"



#include	"AMP_PHY.H"
//#include "AMP_LAY.H"
//#include "AMP_CABV11.H"

#include "STM32_SYS.H"
#include "STM32_GPIO.H"
#include "STM32_SYSTICK.H"
#include "STM32_WDG.H"
#include "STM32_PWM.H"
#include "STM32_FLASH.H"

#include "LCD.H"
#include "ST7789V.H"

#include "font.h"




sAmpLcdDef	sAmpLcd;




unsigned  long*  MCUMEMaddr = (unsigned  long*)(0x1FFFF7E0);
unsigned  short  MCUMEMsize  = 0;

unsigned  char 	gCbFlag		=0;   //0--柜板，1--层板
unsigned	short FlashTime	=0;
unsigned	short Num=0;
//unsigned char testbuffer[]="GPIO_Configuration_OPP50(GPIOA,GPIO_Pin_0);";




/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMPLCDV11_Configuration(void)
{	
	
	SYS_Configuration();				//系统配置
	
  GPIO_Configuration_OPP50(GPIOA,GPIO_Pin_0);
  
  PWM_OUT(TIM2,PWM_OUTChannel2,500,1);	//PWM设定-20161127版本	占空比1/1000
	
	//SysTick_DeleymS(500);				//SysTick延时nmS
	
  HW_Configuration(); 

	DataInitialize();	
  
  IWDG_Configuration(2000);													//独立看门狗配置---参数单位ms
	
	//SetBackColor(LCD565_DARKBLUE);
  ST7789V_Clean(0xFFFF);
	//AMPLCDV11GUI();
  SysTick_Configuration(1000);    //系统嘀嗒时钟配置72MHz,单位为uS  
  while(1)
  {
		AMPLCDV11_Receive();
		AMPLCDV11_Send();
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMPLCDV11_Server(void)
{  
	static unsigned short color=0;
  FlashTime+=1;
	IWDG_Feed();								//独立看门狗喂狗
//	Tim_Server();
  if(FlashTime==2000)
  {
		FlashTime=0;
		#if 1==SelectModel
			DisplayManaStaticTest1();
		#elif 2==SelectModel
			DisplayManaStaticTest2();
		#elif 3==SelectModel
			DisplayManaModel1();
		#elif 4==SelectModel
			DisplayManaModel2();
		#elif 5==SelectModel
			DisplayManaModel3();
		#elif 6==SelectModel
			DisplayManaModel6();
		#endif
//		ST7789V_Clean(0xFFDE);
		//DisplayManaStaticTest1();
  }
  
}




//=================================软件接口End=============================================================



/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMPLCDV11_Send(void)
{ 
  unsigned  short   sendedlen = sAmpLcd.Comm.TxLen;
	if(sendedlen)
	{
		sendedlen	=	RS485_DMASend(&sAmpLcd.Comm.RS485Port,sAmpLcd.Comm.Txd,sendedlen);	//RS485-DMA发送程序
		if(sAmpLcd.Comm.TxLen	==	sendedlen)
		{
			sAmpLcd.Comm.TxLen	=	0;
		}
	}
}
void AMPLCDV11_Ack(void)
{
	memcpy(sAmpLcd.Comm.Txd,ackupfarme,AmpMinFrameSize);
	sAmpLcd.Comm.TxLen	=	AmpMinFrameSize;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMPLCDV11_Receive(void)
{
  unsigned short RxNum  = 0;
  //==========================================================接收查询
  //---------------------层板接口 USART2
  RxNum = RS485_ReadBufferIDLE(&sAmpLcd.Comm.RS485Port,sAmpLcd.Comm.Rxd);
  if(RxNum)
  {	
    AMPLCDV11_Process(sAmpLcd.Comm.Rxd,RxNum);              //柜消息处理
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMPLCDV11_Process(unsigned char* ReceDatabuffer,unsigned short datalen)
{
  unsigned  short framlength  = datalen; 
  unsigned  char* StartAddr    = ReceDatabuffer;         //备份数据缓存起始地址
	
	
	unsigned char	i=0;
	unsigned char DataLen	=0;		//数据段长度
	ManaDef*	ManaData;
  
  stampphydef* ampframe=NULL;
  //-------------------------检查端口是否为层接口及缓存地址是否为空
  if(NULL==StartAddr||0==framlength)
  {
    return;
  }
	
	ReceiveDataCheckStart:	//开始检测接收到的数据
  //-------------------------协议检查
  ampframe	=	(stampphydef*)API_AmpCheckFrame(StartAddr,&framlength);    //判断帧消息内容是否符合协议
  if(NULL== ampframe)
  {
    return;		//退出，未检测到有效的帧
  }
  //-------------------------检查是否为应答帧
	if(AmpCmdAck==ampframe->msg.cmd.cmd)
	{
		goto ReCheckData;		//重新检测剩余的数据
	}
  //-------------------------层地址检查
	if(sAmpLcd.Sys.AddrLay	!=	ampframe->msg.addr.address2)
	{
		goto ReCheckData;		//重新检测剩余的数据
	}
	//-------------------------位地址检查
	if(sAmpLcd.Sys.AddrSeg	!=	ampframe->msg.addr.address3)
	{
		goto ReCheckData;		//重新检测剩余的数据
	}
 
  //-------------------------下发数据
  if(0  ==  ampframe->msg.cmd.dir)	//最高位为0表示上往下发
  {
    //---------------------------显示数据命令
    if(AmpCmdLcdData ==  ampframe->msg.cmd.cmd) 
    {	
			unsigned char* buffer=NULL;
			DataLen	=	ampframe->msg.length-4;		//数据段长度			
			buffer=(unsigned char*)ampframe->msg.data;
			
			PackManaData:
			GetManaData(buffer,DataLen);
			AMPLCDV11_Ack();						
    }
		//---------------------------修改背景色命令--只带2字节数据,低8位颜色在前
		else if(AmpCmdLcdBKCL ==  ampframe->msg.cmd.cmd)
		{
			unsigned short BackColor	=	0;			
			memcpy(&BackColor,ampframe->msg.data,2);	//2字节背景色数据，低位在前
			SetBackColor(BackColor);
			AMPLCDV11_Ack();			
		}
		goto ReCheckData;		//重新检测剩余的数据
  }
	//------------------------------继续检查剩余数据，直到检查失败
	ReCheckData:
	StartAddr=(unsigned char*)&ampframe[1];
	framlength-=1;	//去掉一字节长度
	goto ReceiveDataCheckStart;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void GetManaData(unsigned char* Databuffer,unsigned short datalen)
{
	unsigned char		i=0;
	unsigned char 	strtype		=0;		//字符串类型
	unsigned char 	strLen		=0;		//字符串长度
	unsigned char 	strCount	=0;		//已处理的字符串个数计数
	unsigned char* 	strSource;		//源字符串地址---源自串口接收到的数据
	unsigned char* 	strTarget;		//目标符串地址---存储
	
	ManaDef*	ManaData;
	DisplayDataDef*	pDisplayData;		//
	
	ManaData	=	(ManaDef*)Databuffer;
	//=================================查找空缓存
	for(i=0;i<DspMaxNameTypeCount;i++)
	{
		if(0==sAmpLcd.Display.DisplayArry[i].Serial)		//缓存为空，可以拷贝数据
		{
			pDisplayData	=	&sAmpLcd.Display.DisplayArry[i];
			sAmpLcd.Display.ReceivedManaCount+=1;
			break;
		}
	}	
	//=================================未查找到空缓存，缓存满
	if(i>=DspMaxNameTypeCount)
	{
		return;
	}
	//=================================分类拆装数据
	//---------------------------------初始化指针地址和数据
	strSource	=	ManaData->String;
	strTarget	=	pDisplayData->String;	
	
	//---------------------------------01名称参数
	strtype		=	ManaData->type;
	strLen		=	ManaData->len;
	if(0x01	==	strtype)	//名称参数
	{
		pDisplayData->OffsetName	=	strCount;		
		memcpy(&strTarget[strCount],strSource,strLen);		
		strCount+=strLen;				//已处理字符串		
		pDisplayData->LenName	=	strLen;		
		ManaData	=	(ManaDef*)&strSource[strLen];
		strSource	=	ManaData->String;
		strtype		=	ManaData->type;
		strLen		=	ManaData->len;		
	}
	//---------------------------------02规格参数
	if(0x02	==	strtype)
	{
		pDisplayData->OffsetSpec	=	strCount;
		memcpy(&strTarget[strCount],strSource,strLen);		
		strCount+=strLen;				//已处理字符串		
		pDisplayData->LenSpec	=	strLen;		
		ManaData	=	(ManaDef*)&strSource[strLen];
		strSource	=	ManaData->String;
		strtype		=	ManaData->type;
		strLen		=	ManaData->len;
	}
	//---------------------------------03耗材数量		
	if(0x03	==	ManaData->type)	//数量参数
	{
		pDisplayData->OffsetNum	=	strCount;
		memcpy(&strTarget[strCount],strSource,strLen);		
		strCount+=strLen;				//已处理字符串		
		pDisplayData->LenNum	=	strLen;		
		ManaData	=	(ManaDef*)&strSource[strLen];
		strSource	=	ManaData->String;
		strtype		=	ManaData->type;
		strLen		=	ManaData->len;
	}
	//---------------------------------04别名
	if(0x04	==	strtype)
	{
		pDisplayData->OffsetByName	=	strCount;
		memcpy(&strTarget[strCount],strSource,strLen);		
		strCount+=strLen;				//已处理字符串		
		pDisplayData->LenByName	=	strLen;		
		ManaData	=	(ManaDef*)&strSource[strLen];
		strSource	=	ManaData->String;
		strtype		=	ManaData->type;
		strLen		=	ManaData->len;
	}
	//---------------------------------05厂家名称
	if(0x05	==	strtype)
	{
		pDisplayData->OffsetVender	=	strCount;
		memcpy(&strTarget[strCount],strSource,strLen);		
		strCount+=strLen;				//已处理字符串		
		pDisplayData->LenVender	=	strLen;		
		ManaData	=	(ManaDef*)&strSource[strLen];
		strSource	=	ManaData->String;
		strtype		=	ManaData->type;
		strLen		=	ManaData->len;
	}
	//---------------------------------06耗材编码
	if(0x06	==	strtype)
	{
		pDisplayData->OffsetCode	=	strCount;
		memcpy(&strTarget[strCount],strSource,strLen);		
		strCount+=strLen;				//已处理字符串		
		pDisplayData->LenCode	=	strLen;		
		ManaData	=	(ManaDef*)&strSource[strLen];
		strSource	=	ManaData->String;
		strtype		=	ManaData->type;
		strLen		=	ManaData->len;
	}
	//---------------------------------07数量单位
	if(0x07	==	strtype)
	{
		pDisplayData->OffsetUnit	=	strCount;
		memcpy(&strTarget[strCount],strSource,strLen);		
		strCount+=strLen;				//已处理字符串		
		pDisplayData->LenUnit	=	strLen;		
		ManaData	=	(ManaDef*)&strSource[strLen];
		strSource	=	ManaData->String;
		strtype		=	ManaData->type;
		strLen		=	ManaData->len;
	}
	pDisplayData->Serial	=	sAmpLcd.Display.ReceivedManaCount;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayManaStaticTest1(void)
{
	unsigned char i=0;
	unsigned short x=0,y=0;
	unsigned short xysbac=0;
	unsigned char font=0;
	static unsigned char testnum=0;
	if(testnum++>=99)
		testnum=0;

	x	=	0;
	y	=	8;
	xysbac=y;
	//y=ystarttop;	//ystarttop==8
	//-----------------------------------画上边边线
	ST7789V_Fill(0,0,320,y+2,0x0000);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	
	y+=2;
	ST7789V_Fill(0,y-1,320,y+16,0x865D);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	ST7789V_PrintfBK(x,y,16,0x865D,0x0000,"层号:%0.2d  位号:%0.2d         %d/99::%d/99页",sAmpLcd.Sys.AddrLay%100,sAmpLcd.Sys.AddrSeg%100,testnum%100,(testnum+1)%100);  //LCD显示测试Printf
	ST7789V_Fill(x,y+16,320,y+18,0x8450);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	
	y+=16+3;
	ST7789V_Fill(ST7789V_V-32*2,y+32+16+4,ST7789V_V,y+32+16+4+32,0xFFFF);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	ST7789V_PrintfBK(ST7789V_V-32*2,y+32+16+4,32,0xFFFF,0xFB00,"%0.2d",testnum%100);  //LCD显示测试Printf
	ST7789V_PrintfBK(ST7789V_V-32*1,y+31*2,16,0xFFFF,0xFB00,"盒");  //LCD显示测试Printf
//	y+=32;
	font=24;
	ST7789V_PrintfBK(x,y,font,0xFFFF,0x054A,"测试物品名称1测试物品名称1");  //LCD显示测试Printf
	y+=font;
	ST7789V_PrintfBK(x,y,font,0xFFFF,0x054A,"一次性套管穿刺器一次性套管");  //LCD显示测试Printf
	y+=font+2;
	font=16;
	ST7789V_Printf(x,y,font,0x5ACA,"Ⅲ型Ф10-MBQ2019FF1299-ACTD-MT");  //LCD显示测试Printf
	ST7789V_Printf(x,y+16,font,0x5ACA,"#Яβπポほ㈣019FF1299-ACTD-M");  //LCD显示测试Printf
	y+=font+2;
	
