wegam/STM32F1xWorkSpace/Examples/WOW/AMPLCDV11.C
	//-----------------------------------画中线

	y	=	(ST7789V_H)/2-4+xysbac;
	ST7789V_Fill(0,y,320,y+8,0x8450);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	y+=10;
	
	ST7789V_Fill(ST7789V_V-32*2,y+32+16+4,ST7789V_V,y+32+16+4+32,0xFFFF);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	ST7789V_PrintfBK(ST7789V_V-32*2,y+32+16+4,32,0xFFFF,0xFB00,"%0.2d",testnum+1%100);  //LCD显示测试Printf
	ST7789V_PrintfBK(ST7789V_V-32*1,y+31*2,16,0xFFFF,0xFB00,"瓶");  //LCD显示测试Printf
//	y+=32;
	font=24;
	ST7789V_PrintfBK(x,y,font,0xFFFF,0x054A,"测试物品名称2测试物品名称2");  //LCD显示测试Printf
	y+=font;
	ST7789V_PrintfBK(x,y,font,0xFFFF,0x054A,"（套管穿刺针）        ");  //LCD显示测试Printf
	y+=font+2;
	font=16;
	ST7789V_Printf(x,y,font,0x5ACA,"Ⅲ型Ф10-MBQ2019FF1299-ACTD-MT");  //LCD显示测试Printf
	y+=16;
	ST7789V_Printf(x,y,font,0x5ACA,"#Яβπポほ㈣019FF1299-ACTD-M");  //LCD显示测试Printf
	y+=16;
	y+=16;
	ST7789V_Fill(0,y,320,ST7789V_H,LCD565_BLACK);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)

	testnum+=1;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayManaStaticTest2(void)
{
	unsigned char i	=	0;
	unsigned char len=0;
	unsigned char num=0;
	unsigned char* str;
	
	unsigned char TempLay	=	sAmpLcd.Sys.AddrLay%100;
	unsigned char TempSeg	=	sAmpLcd.Sys.AddrSeg%100;

	
	unsigned short xs=0;
	unsigned short ys=0;
	unsigned short xe=0;
	unsigned short ye=0;
	unsigned short yebac=0;
	
	static unsigned char testnum=0;
	if(testnum++>=99)
		testnum=0;

	//===============================顶部填充
	ye=DisplayTopStartY;	
	ST7789V_Fill(0,0,ST7789V_V,ye,LCD565_BLACK);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	//===============================中间分隔线填充
//	ys	=	(DisplayBotStartY-DisplayTopStartY-DisplayTitleSize-DisplaySeparWidth)/2+DisplayTopStartY+DisplayTitleSize;
//	ST7789V_Fill(0,ys-DisplaySeparWidth,ST7789V_V,ys+DisplaySeparWidth,DisplaySeparBkColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	
	//===============================底部填充
	ys	=	DisplayBotStartY;
	ye	=	DisplayBotEndY;
	ST7789V_Fill(0,ys,ST7789V_V,ST7789V_H,LCD565_BLACK);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	//===============================标题填充
	ys	=	DisplayTopStartY;
	ye	=	DisplayTopStartY+DisplayTitleSize;
	ST7789V_Fill(0,ys,ST7789V_V,ye,DisplayTitleBkColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	//===============================标题分隔线填充
	ys	=	ye;
	ye	=	ys+DisplaySeparWidth;
	ST7789V_Fill(0,ys,ST7789V_V,ye,DisplaySeparBkColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	
	//===============================显示地址
	ys	=	DisplayTopStartY;
	ST7789V_PrintfBK(DisplayStartX,ys,DisplayTitleSize,DisplayTitleBkColor,DisplayTitleFtColor,"层号:%0.2d 位号:%0.2d                 01/03页",TempLay,TempSeg);  //LCD显示测试Printf
	
	//===============================显示别名/学名
	ys	=	ys+DisplayTitleSize+DisplaySeparWidth+1;
	ST7789V_PrintfBK(DisplayStartX,ys,DisplayNameFtSize,DisplayNameBkColor,DisplayNameFtColor,"无纺布食品车间防尘条形帽/医用一次性帽子");  //LCD显示测试Printf
	ys	=	ys+DisplayNameFtSize;
	ST7789V_PrintfBK(DisplayStartX,ys,DisplayNameFtSize,DisplayNameBkColor,DisplayNameFtColor,"无纺布食品车间防尘条形帽/医用一次性帽子");  //LCD显示测试Printf
	//===============================物料编码
	ys	=	ys+DisplayNameFtSize*2;
	ST7789V_PrintfBK(DisplayStartX,ys,DisplayCodeFtSize,DisplayCodeBkColor,DisplayCodeFtColor,"编码:POY20190315-M1");  //LCD显示测试Printf
	//===============================厂家
	ys	=	ys+DisplayCodeFtSize;
	ST7789V_PrintfBK(DisplayStartX,ys,DisplayVenderFtSize,DisplayVenderBkColor,DisplayVenderFtColor,"厂家:特斯拉中国 - Tesla");  //LCD显示测试Printf
	//===============================规格
	ys	=	ys+DisplayVenderFtSize;
	ST7789V_PrintfBK(DisplayStartX,ys,DisplaySpecFtSize,DisplaySpecBkColor,DisplaySpecFtColor,"规格:Red 1000x40000000cm");  //LCD显示测试Printf
	//===============================数量
	xs	=	ST7789V_V-DisplayNumFtSize*2;
	ys	=	ys+DisplaySpecFtSize-DisplayNumFtSize;
	ST7789V_PrintfBK(xs,ys,DisplayNumFtSize,DisplayNumBkColor,DisplayNumFtColor,"13包");  //LCD显示测试Printf
	
	//-----------------------------------画上边边线
//	ST7789V_Fill(0,0,320,y+2,0x0000);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//	
//	y+=2;
//	ST7789V_Fill(0,y-1,320,y+16,0x865D);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//	ST7789V_PrintfBK(x,y,16,0x865D,0x0000,"层号:%0.2d  位号:%0.2d         %d/99::%d/99页",sAmpLcd.Addr.Lay%100,sAmpLcd.Addr.Seg%100,testnum%100,(testnum+1)%100);  //LCD显示测试Printf
//	ST7789V_Fill(x,y+16,320,y+18,0x8450);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//	
//	y+=16+3;
//	ST7789V_Fill(ST7789V_V-32*2,y+32+16+4,ST7789V_V,y+32+16+4+32,0xFFFF);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//	ST7789V_PrintfBK(ST7789V_V-32*2,y+32+16+4,32,0xFFFF,0xFB00,"%0.2d",testnum%100);  //LCD显示测试Printf
//	ST7789V_PrintfBK(ST7789V_V-32*1,y+31*2,16,0xFFFF,0xFB00,"盒");  //LCD显示测试Printf
////	y+=32;
//	font=24;
//	ST7789V_PrintfBK(x,y,font,0xFFFF,0x054A,"测试物品名称1测试物品名称1",sAmpLcd.Addr.Lay,sAmpLcd.Addr.Seg);  //LCD显示测试Printf
//	y+=font;
//	ST7789V_PrintfBK(x,y,font,0xFFFF,0x054A,"一次性套管穿刺器一次性套管",sAmpLcd.Addr.Lay,sAmpLcd.Addr.Seg);  //LCD显示测试Printf
//	y+=font+2;
//	font=16;
//	ST7789V_Printf(x,y,font,0x5ACA,"Ⅲ型Ф10-MBQ2019FF1299-ACTD-MT",sAmpLcd.Addr.Lay,sAmpLcd.Addr.Seg);  //LCD显示测试Printf
//	ST7789V_Printf(x,y+16,font,0x5ACA,"#Яβπポほ㈣019FF1299-ACTD-M",sAmpLcd.Addr.Lay,sAmpLcd.Addr.Seg);  //LCD显示测试Printf
//	y+=font+2;
//	
//	//-----------------------------------画中线

//	y	=	(ST7789V_H)/2-4+xysbac;
//	ST7789V_Fill(0,y,320,y+8,0x8450);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//	y+=10;
//	
//	ST7789V_Fill(ST7789V_V-32*2,y+32+16+4,ST7789V_V,y+32+16+4+32,0xFFFF);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//	ST7789V_PrintfBK(ST7789V_V-32*2,y+32+16+4,32,0xFFFF,0xFB00,"%0.2d",testnum+1%100);  //LCD显示测试Printf
//	ST7789V_PrintfBK(ST7789V_V-32*1,y+31*2,16,0xFFFF,0xFB00,"瓶");  //LCD显示测试Printf
////	y+=32;
//	font=24;
//	ST7789V_PrintfBK(x,y,font,0xFFFF,0x054A,"测试物品名称2测试物品名称2",sAmpLcd.Addr.Lay,sAmpLcd.Addr.Seg);  //LCD显示测试Printf
//	y+=font;
//	ST7789V_PrintfBK(x,y,font,0xFFFF,0x054A,"（套管穿刺针）        ",sAmpLcd.Addr.Lay,sAmpLcd.Addr.Seg);  //LCD显示测试Printf
//	y+=font+2;
//	font=16;
//	ST7789V_Printf(x,y,font,0x5ACA,"Ⅲ型Ф10-MBQ2019FF1299-ACTD-MT",sAmpLcd.Addr.Lay,sAmpLcd.Addr.Seg);  //LCD显示测试Printf
//	y+=16;
//	ST7789V_Printf(x,y,font,0x5ACA,"#Яβπポほ㈣019FF1299-ACTD-M",sAmpLcd.Addr.Lay,sAmpLcd.Addr.Seg);  //LCD显示测试Printf
//	y+=16;
//	y+=16;
//	ST7789V_Fill(0,y,320,ST7789V_H,LCD565_BLACK);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)

//	testnum+=1;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayManaModel1(void)
{
	unsigned char i	=	0;
	unsigned char len=0;
	unsigned char num=0;
	unsigned char	offset	=	0;
	unsigned char* str;
	//unsigned char  FontSize	=	0;
	
	unsigned short xs=0;
	unsigned short ys=0;
	unsigned short xe=0;
	unsigned short ye=0;
	unsigned short yebac=0;
	
	DisplayDataDef	DisplayData;		//

	if(0>=sAmpLcd.Display.ReceivedManaCount)	//没收到数据显示位置号
	{
		unsigned char TempLay	=	sAmpLcd.Sys.AddrLay%100;
		unsigned char TempSeg	=	sAmpLcd.Sys.AddrSeg%100;
		ST7789V_PrintfBK(68,ST7789V_H/2-DisplayNumFtSize/2,DisplayNumFtSize,DisplayNumBkColor,DisplayNumFtColor,"层%0.2d    位%0.2d",TempLay,TempSeg);  //LCD显示测试Printf
		return;
	}
	if(0==sAmpLcd.Display.DisplaySerial)
	{
		sAmpLcd.Display.DisplaySerial=1;
	}
	if(sAmpLcd.Display.DisplaySerial>sAmpLcd.Display.ReceivedManaCount)
	{
		sAmpLcd.Display.DisplaySerial=1;
	}
	
	//=====================================清空区域:名称
	xs	=	0;
	xe	=	ST7789V_V;
	ys	=	DisplayTopStartY;
	ye	=	DisplayBotStartY;
	
	ST7789V_Fill(xs,ys,xe,ye,DisplayNameBkColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)	
	
	//===============================顶部填充
	ye=DisplayTopStartY;	
	ST7789V_Fill(0,0,ST7789V_V,ye,LCD565_BLACK);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	//===============================中间填充
	//ys=DisplayTopStartY+DisplayNameFtSize*2+DisplaySpecFtSize*3;
	ys	=	(DisplayBotStartY-DisplayTopStartY)/2+DisplayTopStartY;
	ST7789V_Fill(0,ys-2,ST7789V_V,ys+2,LCD565_BLACK);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	
	//===============================底部填充
	ys	=	DisplayBotStartY;
	ye	=	DisplayBotEndY;
	ST7789V_Fill(0,ys,ST7789V_V,ST7789V_H,LCD565_BLACK);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	
	ys=DisplayTopStartY+1;
	
	DisplayStart:
	//-------------------------------第一行
	for(i=0;i<sAmpLcd.Display.ReceivedManaCount;i++)
	{
		if(sAmpLcd.Display.DisplaySerial==sAmpLcd.Display.DisplayArry[i].Serial)
		{
			unsigned char temp[100];
			DisplayData	=	sAmpLcd.Display.DisplayArry[i];
			yebac	=	ys;			
			
			//=====================================数量
			//-------------------------------------取数量数据
			offset	=	DisplayData.LenName+DisplayData.LenSpec;
			str	=	&str[offset];
			memcpy(temp,str,DisplayData.LenNum);
			//-------------------------------------取单位数据
			offset	=	DisplayData.LenName+DisplayData.LenSpec+DisplayData.LenNum+DisplayData.LenByName+DisplayData.LenVender+DisplayData.LenCode;
			str	=	&str[offset];
			memcpy(&temp[DisplayData.LenNum],str,DisplayData.LenUnit);
			//num	=	DisplayData.Num;
			//ST7789V_ShowChar4836(248,ys,DisplayNumBkColor,DisplayNumFtColor,code_ascii_4836[num/10]);	 	//高通字库测试程序
			//ST7789V_ShowChar4836(284,ys,DisplayNumBkColor,DisplayNumFtColor,code_ascii_4836[num%10]);	  //高通字库测试程序
			
			//=====================================显示名称：10个字(20字节)一行						
			
			//-----------------------------------------第一行
			xs	=	0;
			str	=	DisplayData.String;
			len	=	DisplayData.LenName;		//字节数
			num	=	(ST7789V_V-36*2)/(DisplayNameFtSize/2);			//一行能够显示的数量
			if(len>num)
			{
				ST7789V_ShowStringBK(xs,ys,DisplayNameFtSize,DisplayNameBkColor,DisplayNameFtColor,num,str);				
				len-=num;
				str=&str[num];
				ys+=DisplayNameFtSize;
			}			
			//-----------------------------------------第二行
			if(len>0)
			{
				if(len>num)
				{
					num=num;
				}
				else
				{
					num=len;
				}
				ST7789V_ShowStringBK(xs,ys,DisplayNameFtSize,DisplayNameBkColor,DisplayNameFtColor,num,str);
				ys+=DisplayNameFtSize;
			}
			//=====================================显示序号
			
			ys=yebac+DisplayNameFtSize*2+DisplaySpecFtSize*1;
			
			xs	=	ST7789V_V-DisplaySerialFtSize*3;
			ST7789V_PrintfBK(xs,ys,DisplaySerialFtSize,DisplayNameBkColor,DisplayNameFtColor,"%0.2d/%0.2d",sAmpLcd.Display.DisplaySerial,sAmpLcd.Display.ReceivedManaCount);
			
			//=====================================显示规格
			
			//-----------------------------------------第一行
			xs	=	0;
			xe	=	ST7789V_V-DisplaySerialFtSize*3;
			ys=yebac+DisplayNameFtSize*2+1;
			
			len	=	DisplayData.LenName;			//字节数
			str	=	&DisplayData.String[len];
			len	=	DisplayData.LenSpec;
			
			num	=	(ST7789V_V-DisplaySerialFtSize*3)/(DisplaySpecFtSize/2);			//一行能够显示的数量
			if(len>num)
			{
				ST7789V_ShowStringBK(0,ys,DisplaySpecFtSize,DisplaySpecBkColor,DisplaySpecFtColor,num,str);
				ys+=DisplaySpecFtSize;
				len-=num;
				str=&str[num];
			}
			//-----------------------------------------第二行
			if(len>0)
			{
				if(len>num)
				{
					num=num;
				}
				else
				{
					num=len;
				}
				ST7789V_ShowStringBK(0,ys,DisplaySpecFtSize,DisplaySpecBkColor,DisplaySpecFtColor,num,str);
			}				
			sAmpLcd.Display.DisplaySerial+=1;			
			break;
		}		
	}
	
	if(ys<ST7789V_H/2)
	{
		ys	=	(DisplayBotStartY-DisplayTopStartY)/2+DisplayTopStartY+3;
		goto DisplayStart;
	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayManaModel2(void)
{
	unsigned char i	=	0;
	unsigned char len=0;
	unsigned char num=0;
	unsigned char size=0;
	unsigned char offset=0;
	unsigned char	buffer[256];
	unsigned char* str;
	
	unsigned char TempLay	=	sAmpLcd.Sys.AddrLay%100;
	unsigned char TempSeg	=	sAmpLcd.Sys.AddrSeg%100;
	
	unsigned short xs=0;
	unsigned short ys=0;
	unsigned short xe=0;
	unsigned short ye=0;
	unsigned short yebac=0;
	
	DisplayDataDef	DisplayData;		//
	

	if(0>=sAmpLcd.Display.ReceivedManaCount)	//没收到数据显示位置号
	{		
		ST7789V_PrintfBK(68,ST7789V_H/2-DisplayNumFtSize/2,DisplayNumFtSize,DisplayNumBkColor,DisplayNumFtColor,"层%0.2d    位%0.2d",TempLay,TempSeg);  //LCD显示测试Printf
		return;
	}
	if(0==sAmpLcd.Display.DisplaySerial)
	{
		sAmpLcd.Display.DisplaySerial=1;
	}
	if(sAmpLcd.Display.DisplaySerial>sAmpLcd.Display.ReceivedManaCount)
	{
		sAmpLcd.Display.DisplaySerial=1;
	}
	
	//=====================================清空区域:名称
	xs	=	0;
	xe	=	ST7789V_V;
	ys	=	DisplayTopStartY;
	ye	=	DisplayBotStartY;
	
	ST7789V_Fill(xs,ys,xe,ye,DisplayClrColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)	
	
	//===============================顶部填充
	ye=DisplayTopStartY;	
	ST7789V_Fill(0,0,ST7789V_V,ye,LCD565_BLACK);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	//===============================中间分隔线填充
	ys	=	(DisplayBotStartY-DisplayTopStartY-DisplayTitleSize-DisplaySeparWidth)/2+DisplayTopStartY+DisplayTitleSize;
	ST7789V_Fill(0,ys-DisplaySeparWidth,ST7789V_V,ys+DisplaySeparWidth,DisplaySeparBkColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	
	//===============================底部填充
	ys	=	DisplayBotStartY;
	ye	=	DisplayBotEndY;
	ST7789V_Fill(0,ys,ST7789V_V,ST7789V_H,LCD565_BLACK);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	//===============================标题填充
	ys	=	DisplayTopStartY;
	ye	=	DisplayTopStartY+DisplayTitleSize;
	ST7789V_Fill(0,ys,ST7789V_V,ye,DisplayTitleBkColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	//===============================标题分隔线填充
	ys	=	DisplayTopStartY+DisplayTitleSize;
	ye	=	ys+DisplaySeparWidth;
	ST7789V_Fill(0,ys,ST7789V_V,ye,DisplaySeparBkColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	
	//===============================显示地址
	ST7789V_PrintfBK(1,DisplayTopStartY,16,DisplayTitleBkColor,DisplayTitleFtColor,"层号:%0.2d 位号:%0.2d",TempLay,TempSeg);  //LCD显示测试Printf
	//===============================显示起始
	ys=DisplayTopStartY+DisplayTitleSize+DisplaySeparWidth+1;
	
	DisplayStart:
	//-------------------------------第一行
	for(i=0;i<sAmpLcd.Display.ReceivedManaCount;i++)
	{
		if(sAmpLcd.Display.DisplaySerial==sAmpLcd.Display.DisplayArry[i].Serial)
		{
			unsigned char Sum			=	sAmpLcd.Display.ReceivedManaCount;
			unsigned char Serial	=	sAmpLcd.Display.DisplaySerial;
			
			DisplayData=sAmpLcd.Display.DisplayArry[i];
			
			yebac	=	ys;			
			
			//=====================================显示序号
			if(ys<DisplayTopStartY*4)
			{
				ST7789V_PrintfBK(ST7789V_V-DisplayTitleSize*4,DisplayTopStartY,DisplayTitleSize,DisplayTitleBkColor,DisplayTitleFtColor,"%0.2d/%0.2d页",Serial,Sum);  //LCD显示测试Printf
			}
			else
			{
				ST7789V_PrintfBK(ST7789V_V-DisplayTitleSize*8,DisplayTopStartY,DisplayTitleSize,DisplayTitleBkColor,DisplayTitleFtColor,"%0.2d/%0.2d页 %0.2d/%0.2d页",Serial-1,Sum,Serial,Sum);  //LCD显示测试Printf
			}
			//=====================================显示数量和单位
			
			str			=	DisplayData.String;
			len			=	DisplayData.LenNum;
			offset	=	DisplayData.OffsetNum;			
			memcpy(buffer,&str[offset],len);
			
			len			=	DisplayData.LenUnit;
			offset	=	DisplayData.OffsetUnit;			
			memcpy(&buffer[DisplayData.LenNum],&str[offset],len);		
			
				
			
