wegam/STM32F1xWorkSpace/Examples/WOW/AMPLCDV11.C
			num	=	DisplayData.LenNum+DisplayData.LenUnit;
			
			xs			=	ST7789V_V-(DisplayNumFtSize/2)*(DisplayData.LenNum+DisplayData.LenUnit);
			ys			=	yebac+DisplayNameFtSize*2;
			str			=	buffer;			
			
			ST7789V_ShowStringBK(xs,ys,DisplayNumFtSize,DisplayNumBkColor,DisplayNumFtColor,num,str);

			//=====================================显示名称：10个字(20字节)一行			
			xs	=	0;
			ys	=	yebac;
			
			str	=	DisplayData.String;
			len	=	DisplayData.LenName;		//字节数
			num	=	(ST7789V_V)/(DisplayNameFtSize/2);			//一行能够显示的数量
			if(len>2*num)
			{
				num=2*num;
			}
			else
			{
				num=len;
			}
			ST7789V_Fill(0,ys,ST7789V_V,ys+DisplayNameFtSize*2,DisplayNameBkColor);
			ST7789V_ShowStringBK(xs,ys,DisplayNameFtSize,DisplayNameBkColor,DisplayNameFtColor,num,str);
			ys+=DisplayNameFtSize*2;
			//=====================================显示规格			
			//-----------------------------------------第一行
			
			xs	=	0;
			xe	=	ST7789V_V-(DisplayNumFtSize/2)*(DisplayData.LenNum+DisplayData.LenUnit);
			ys	=	yebac+DisplayNameFtSize*2+1;
			ye	=	ys+DisplaySpecFtSize*2;
			
			size=strlen("规格:");
			memcpy(&buffer[0],"规格:",len);
			
			len	=	DisplayData.LenSpec;			//字节数
			offset	=	DisplayData.OffsetSpec;
			
			str	=	&DisplayData.String[offset];
			memcpy(&buffer[size],str,len);
 
			len=len+size;
	
			ST7789V_ShowStringBKAre(xs,ys,xe,ye,DisplaySpecFtSize,DisplaySpecBkColor,DisplaySpecFtColor,len,buffer);	//带背景色限定区域显示		

			sAmpLcd.Display.DisplaySerial+=1;			
			break;
		}		
	}
	
	if(ys<ST7789V_H/2)
	{
		ys	=	(DisplayBotStartY-DisplayTopStartY-DisplayTitleSize-DisplaySeparWidth)/2+DisplayTopStartY+DisplayTitleSize+DisplaySeparWidth*2-1;
		//ys	=	(DisplayBotStartY-DisplayTopStartY-DisplaySeparWidth)/2+DisplayTopStartY+3;
		goto DisplayStart;
	}
}

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayManaModel3(void)
{
	unsigned char i	=	0;
	unsigned char len=0;
	unsigned char num=0;
	unsigned char* str;
	
	unsigned char TempLay	=	sAmpLcd.Sys.AddrLay%100;
	unsigned char TempSeg	=	sAmpLcd.Sys.AddrSeg%100;

	
	unsigned short xs=0;
	unsigned short ys=0;
	unsigned short xe=0;
	unsigned short ye=0;
	unsigned short yebac=0;
	

	if(0>=sAmpLcd.Display.ReceivedManaCount)	//没收到数据显示位置号
	{		
		ST7789V_PrintfBK(68,ST7789V_H/2-DisplayNumFtSize/2,DisplayNumFtSize,DisplayNumBkColor,DisplayNumFtColor,"层%0.2d    位%0.2d",TempLay,TempSeg);  //LCD显示测试Printf
		return;
	}
	if(0==sAmpLcd.Display.DisplaySerial)
	{
		sAmpLcd.Display.DisplaySerial=1;
	}
	if(sAmpLcd.Display.DisplaySerial>sAmpLcd.Display.ReceivedManaCount)
	{
		sAmpLcd.Display.DisplaySerial=1;
	}
	
	//=====================================清空区域:名称
	xs	=	0;
	xe	=	ST7789V_V;
	ys	=	DisplayTopStartY;
	ye	=	DisplayBotStartY;
	
	ST7789V_Fill(xs,ys,xe,ye,DisplayNameBkColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)	
	
	//===============================顶部填充
	ye=DisplayTopStartY;	
	ST7789V_Fill(0,0,ST7789V_V,ye,LCD565_BLACK);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//	//===============================中间分隔线填充
//	ys	=	(DisplayBotStartY-DisplayTopStartY-DisplayTitleSize-DisplaySeparWidth)/2+DisplayTopStartY+DisplayTitleSize;
//	ST7789V_Fill(0,ys-DisplaySeparWidth,ST7789V_V,ys+DisplaySeparWidth,DisplaySeparBkColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	
	//===============================底部填充
	ys	=	DisplayBotStartY;
	ye	=	DisplayBotEndY;
	ST7789V_Fill(0,ys,ST7789V_V,ST7789V_H,LCD565_BLACK);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	//===============================标题填充
	ys	=	DisplayTopStartY;
	ye	=	DisplayTopStartY+DisplayTitleSize;
	ST7789V_Fill(0,ys,ST7789V_V,ye,DisplayTitleBkColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	//===============================标题分隔线填充
	ys	=	DisplayTopStartY+DisplayTitleSize;
	ye	=	ys+DisplaySeparWidth;
	ST7789V_Fill(0,ys,ST7789V_V,ye,DisplaySeparBkColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	
	//===============================显示地址
	ST7789V_PrintfBK(1,DisplayTopStartY,DisplayTitleSize,DisplayTitleBkColor,DisplayTitleFtColor,"%0.2d::%0.2d",TempLay,TempSeg);  //LCD显示测试Printf
	//===============================显示起始
	ys=DisplayTopStartY+DisplayTitleSize+DisplaySeparWidth+1;
	
	DisplayStart:
	//-------------------------------第一行
	for(i=0;i<sAmpLcd.Display.ReceivedManaCount;i++)
	{
		if(sAmpLcd.Display.DisplaySerial==sAmpLcd.Display.DisplayArry[i].Serial)
		{
			unsigned char Sum			=	sAmpLcd.Display.ReceivedManaCount;
			unsigned char Serial	=	sAmpLcd.Display.DisplaySerial;
			yebac	=	ys;			
			
			//=====================================显示序号
			if(ys<DisplayTopStartY*4)
			{
				ST7789V_PrintfBK(ST7789V_V-DisplayTitleSize*4,DisplayTopStartY,DisplayTitleSize,DisplayTitleBkColor,DisplayTitleFtColor,"%0.2d/%0.2d页",Serial,Sum);  //LCD显示测试Printf
			}
			
			//=====================================显示名称：10个字(20字节)一行			
			//-----------------------------------------第一行
			xs	=	0;
			ys	=	yebac;
			str	=	sAmpLcd.Display.DisplayArry[i].String;
			len	=	sAmpLcd.Display.DisplayArry[i].LenName;		//字节数
			num	=	(ST7789V_V)/(DisplayNameFtSize/2);			//一行能够显示的数量
			ST7789V_ShowStringBKAre(xs,ys,ST7789V_V,ys+DisplayNameFtSize*2,DisplayNameFtSize,DisplayNameBkColor,DisplayNameFtColor,len,str);	//带背景色限定区域显示
			ys+=DisplayNameFtSize*2;
			
			//=====================================显示规格			
			//-----------------------------------------第一行
			xs	=	0;
			xe	=	ST7789V_V-DisplayNumFtSize*2;
			ys=		yebac+DisplayNameFtSize*2+1;
			ye	=	ys+DisplaySpecFtSize*2;
			
			len	=	sAmpLcd.Display.DisplayArry[i].LenName;			//字节数
			str	=	&sAmpLcd.Display.DisplayArry[i].String[len];
			len	=	sAmpLcd.Display.DisplayArry[i].LenSpec;
			
			ST7789V_ShowStringBKAre(xs,ys,xe,ye,DisplaySpecFtSize,DisplaySpecBkColor,DisplaySpecFtColor,len,str);	//带背景色限定区域显示
			
			//=====================================显示数量
			num	=	sAmpLcd.Display.DisplayArry[i].Num;
			xs	=	ST7789V_V-DisplayNumFtSize*2;
			xe	=	ST7789V_V;
			ys	=	yebac+DisplayNameFtSize*2;
			ye	=	ys+DisplayNumFtSize;
			
			ST7789V_PrintfBK(xs,ys,DisplayNumFtSize,DisplayNumBkColor,DisplayNumFtColor,"%0.2d",num);
			xs+=DisplayNumFtSize;
			//=====================================显示单位			
			ST7789V_PrintfBK(xs,ys,32,DisplayNumBkColor,DisplayNumFtColor,"瓶");
			//ST7789V_ShowStringBKAre(u16 xs,u16 ys,u16 xe,u16 ye,u8 font,u16 BKColor,u16 PenColor,u8 num,u8 *Buffer);	//带背景色限定区域显示
			//ST7789V_ShowStringBKAre(xs,ys,xe,ye,DisplaySpecFtSize,DisplayNumBkColor,DisplayNumFtColor,len,str);	//带背景色限定区域显示
				
			sAmpLcd.Display.DisplaySerial+=1;			
			break;
		}		
	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayManaModel3bac(void)
{
	unsigned char i	=	0;
	unsigned char len=0;
	unsigned char num=0;
	unsigned char* str;
	
	unsigned char TempLay	=	sAmpLcd.Sys.AddrLay%100;
	unsigned char TempSeg	=	sAmpLcd.Sys.AddrSeg%100;

	
	unsigned short xs=0;
	unsigned short ys=0;
	unsigned short xe=0;
	unsigned short ye=0;
	unsigned short yebac=0;
	

	if(0>=sAmpLcd.Display.ReceivedManaCount)	//没收到数据显示位置号
	{		
		ST7789V_PrintfBK(68,ST7789V_H/2-DisplayNumFtSize/2,DisplayNumFtSize,DisplayNumBkColor,DisplayNumFtColor,"层%0.2d    位%0.2d",TempLay,TempSeg);  //LCD显示测试Printf
		return;
	}
	if(0==sAmpLcd.Display.DisplaySerial)
	{
		sAmpLcd.Display.DisplaySerial=1;
	}
	if(sAmpLcd.Display.DisplaySerial>sAmpLcd.Display.ReceivedManaCount)
	{
		sAmpLcd.Display.DisplaySerial=1;
	}
	
	//=====================================清空区域:名称
	xs	=	0;
	xe	=	ST7789V_V;
	ys	=	DisplayTopStartY;
	ye	=	DisplayBotStartY;
	
	ST7789V_Fill(xs,ys,xe,ye,DisplayNameBkColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)	
	
	//===============================顶部填充
	ye=DisplayTopStartY;	
	ST7789V_Fill(0,0,ST7789V_V,ye,LCD565_BLACK);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//	//===============================中间分隔线填充
//	ys	=	(DisplayBotStartY-DisplayTopStartY-DisplayTitleSize-DisplaySeparWidth)/2+DisplayTopStartY+DisplayTitleSize;
//	ST7789V_Fill(0,ys-DisplaySeparWidth,ST7789V_V,ys+DisplaySeparWidth,DisplaySeparBkColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	
	//===============================底部填充
	ys	=	DisplayBotStartY;
	ye	=	DisplayBotEndY;
	ST7789V_Fill(0,ys,ST7789V_V,ST7789V_H,LCD565_BLACK);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	//===============================标题填充
	ys	=	DisplayTopStartY;
	ye	=	DisplayTopStartY+DisplayTitleSize;
	ST7789V_Fill(0,ys,ST7789V_V,ye,DisplayTitleBkColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	//===============================标题分隔线填充
	ys	=	DisplayTopStartY+DisplayTitleSize;
	ye	=	ys+DisplaySeparWidth;
	ST7789V_Fill(0,ys,ST7789V_V,ye,DisplaySeparBkColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	
	//===============================显示地址
	ST7789V_PrintfBK(1,DisplayTopStartY,DisplayTitleSize,DisplayTitleBkColor,DisplayTitleFtColor,"%0.2d::%0.2d",TempLay,TempSeg);  //LCD显示测试Printf
	//===============================显示起始
	ys=DisplayTopStartY+DisplayTitleSize+DisplaySeparWidth+1;
	
	DisplayStart:
	//-------------------------------第一行
	for(i=0;i<sAmpLcd.Display.ReceivedManaCount;i++)
	{
		if(sAmpLcd.Display.DisplaySerial==sAmpLcd.Display.DisplayArry[i].Serial)
		{
			unsigned char Sum			=	sAmpLcd.Display.ReceivedManaCount;
			unsigned char Serial	=	sAmpLcd.Display.DisplaySerial;
			yebac	=	ys;			
			
			//=====================================显示序号
			if(ys<DisplayTopStartY*4)
			{
				ST7789V_PrintfBK(ST7789V_V-DisplayTitleSize*4,DisplayTopStartY,DisplayTitleSize,DisplayTitleBkColor,DisplayTitleFtColor,"%0.2d/%0.2d页",Serial,Sum);  //LCD显示测试Printf
			}
			//=====================================显示数量
			num	=	sAmpLcd.Display.DisplayArry[i].Num;
			xs	=	ST7789V_V-DisplayNumFtSize*2;
			ys	=	yebac+DisplayNameFtSize*2;
			
			ST7789V_PrintfBK(xs,ys,DisplayNumFtSize,DisplayNumBkColor,DisplayNumFtColor,"%0.2d",num);
			xs+=DisplayNumFtSize;
			ST7789V_PrintfBK(xs,ys,32,DisplayNumBkColor,DisplayNumFtColor,"瓶");
			//=====================================显示名称：10个字(20字节)一行			
			//-----------------------------------------第一行
			xs	=	0;
			ys	=	yebac;
			str	=	sAmpLcd.Display.DisplayArry[i].String;
			len	=	sAmpLcd.Display.DisplayArry[i].LenName;		//字节数
			num	=	(ST7789V_V)/(DisplayNameFtSize/2);			//一行能够显示的数量
			if(len>num)
			{
				ST7789V_ShowStringBK(xs,ys,DisplayNameFtSize,DisplayNameBkColor,DisplayNameFtColor,num,str);				
				len-=num;
				str=&str[num];
				ys+=DisplayNameFtSize;
			}			
			//-----------------------------------------第二行
			if(len>0)
			{
				if(len>num)
				{
					num=num;
				}
				else
				{
					num=len;
				}
				ST7789V_ShowStringBK(xs,ys,DisplayNameFtSize,DisplayNameBkColor,DisplayNameFtColor,num,str);
				ys+=DisplayNameFtSize;
			}			
			
			//=====================================显示规格			
			//-----------------------------------------第一行
			xs	=	0;
			xe	=	ST7789V_V-DisplaySerialFtSize*3;
			ys=yebac+DisplayNameFtSize*2+1;
			
