wegam/STM32F1xWorkSpace/Examples/WOW/AMPLCDV11.C
			len	=	sAmpLcd.Display.DisplayArry[i].LenName;			//字节数
			str	=	&sAmpLcd.Display.DisplayArry[i].String[len];
			len	=	sAmpLcd.Display.DisplayArry[i].LenSpec;
			
			num	=	(ST7789V_V-DisplayNumFtSize/2*5)/(DisplaySpecFtSize/2);			//一行能够显示的数量
			if(len>num)
			{
				ST7789V_ShowStringBK(0,ys,DisplaySpecFtSize,DisplaySpecBkColor,DisplaySpecFtColor,num,str);
				ys+=DisplaySpecFtSize;
				len-=num;
				str=&str[num];
			}
			//-----------------------------------------第二行
			if(len>0)
			{
				if(len>num)
				{
					num=num;
				}
				else
				{
					num=len;
				}
				ST7789V_ShowStringBK(0,ys,DisplaySpecFtSize,DisplaySpecBkColor,DisplaySpecFtColor,num,str);
			}				
			sAmpLcd.Display.DisplaySerial+=1;			
			break;
		}		
	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayManaModel6(void)
{
	unsigned char i	=	0;
	unsigned char len=0;
	unsigned char num=0;
	unsigned char size=0;
	unsigned char offset=0;
	unsigned char	buffer[256];
	unsigned char* str;
	
	unsigned char TempLay	=	sAmpLcd.Sys.AddrLay%100;
	unsigned char TempSeg	=	sAmpLcd.Sys.AddrSeg%100;
	
	unsigned short xs=0;
	unsigned short ys=0;
	unsigned short xe=0;
	unsigned short ye=0;
	unsigned short yebac=0;
	
	DisplayDataDef	DisplayData;		//
	

	if(0>=sAmpLcd.Display.ReceivedManaCount)	//没收到数据显示位置号
	{		
		ST7789V_PrintfBK(68,ST7789V_H/2-DisplayNumFtSize/2,DisplayNumFtSize,DisplayNumBkColor,DisplayNumFtColor,"层%0.2d    位%0.2d",TempLay,TempSeg);  //LCD显示测试Printf
		return;
	}
	if(0==sAmpLcd.Display.DisplaySerial)
	{
		sAmpLcd.Display.DisplaySerial=1;
	}
	if(sAmpLcd.Display.DisplaySerial>sAmpLcd.Display.ReceivedManaCount)
	{
		sAmpLcd.Display.DisplaySerial=1;
	}
	
	//=====================================清空区域:名称
	xs	=	0;
	xe	=	ST7789V_V;
	ys	=	DisplayTopStartY;
	ye	=	DisplayBotStartY;
	
	//ST7789V_Fill(xs,ys,xe,ye,DisplayClrColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)	
	
	//===============================顶部填充
	ye=DisplayTopStartY;	
	ST7789V_Fill(0,0,ST7789V_V,ye,LCD565_BLACK);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	//===============================中间分隔线填充
	ys	=	(DisplayBotStartY-DisplayTopStartY-DisplayTitleSize-DisplaySeparWidth)/2+DisplayTopStartY+DisplayTitleSize;
	ST7789V_Fill(0,ys-DisplaySeparWidth,ST7789V_V,ys+DisplaySeparWidth,DisplaySeparBkColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	
	//===============================底部填充
	ys	=	DisplayBotStartY;
	ye	=	DisplayBotEndY;
	ST7789V_Fill(0,ys,ST7789V_V,ST7789V_H,LCD565_BLACK);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	//===============================标题填充
	ys	=	DisplayTopStartY;
	ye	=	DisplayTopStartY+DisplayTitleSize;
	ST7789V_Fill(0,ys,ST7789V_V,ye,DisplayTitleBkColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	//===============================标题分隔线填充
	ys	=	DisplayTopStartY+DisplayTitleSize;
	ye	=	ys+DisplaySeparWidth;
	ST7789V_Fill(0,ys,ST7789V_V,ye,DisplaySeparBkColor);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	
	//===============================显示地址
	ST7789V_PrintfBK(1,DisplayTopStartY,16,DisplayTitleBkColor,DisplayTitleFtColor,"层号:%0.2d 位号:%0.2d",TempLay,TempSeg);  //LCD显示测试Printf
	//===============================显示起始
	ys=DisplayTopStartY+DisplayTitleSize+DisplaySeparWidth+1;
	
	DisplayStart:
	//-------------------------------第一行
	for(i=0;i<sAmpLcd.Display.ReceivedManaCount;i++)
	{
		if(sAmpLcd.Display.DisplaySerial==sAmpLcd.Display.DisplayArry[i].Serial)
		{
			unsigned char Sum			=	sAmpLcd.Display.ReceivedManaCount;
			unsigned char Serial	=	sAmpLcd.Display.DisplaySerial;
			
			DisplayData=sAmpLcd.Display.DisplayArry[i];
			
			DisplaySetInfo(DisplayData);		//设置显示信息
			DisplayName(DisplayData);				//显示名称
			DisplayByName(DisplayData);			//显示别名
			DisplayVender(DisplayData);			//显示厂家名称
			DisplaySpec(DisplayData);				//显示规格
			DisplayCode(DisplayData);				//显示编码
			DisplayNumber(DisplayData);			//显示数量和单位
			sAmpLcd.Display.DisplaySerial+=1;	
			break;
		}		
	}
//	if(sAmpLcd.Display.WinInfo.StartX<ST7789V_H/2)
//	{
//		goto DisplayStart;
//	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplaySetInfo(const DisplayDataDef DisplayData)
{
	//unsigned char i	=	0;
	unsigned char len=0;
	unsigned char num=0;
	unsigned char coux=0;		//x轴字符个数
	unsigned char couy=0;		//y轴字符个数
	unsigned char size=0;
	//unsigned char offset=0;
	//unsigned char	buffer[256];
	//unsigned char* str;

	unsigned short xs=0;
	unsigned short ys=0;
	unsigned short xe=0;
	unsigned short ye=0;
	unsigned short ysum=0;		//总共显示需要的垂直点数
	//unsigned short yebac=0;
	unsigned short temp=0;
	unsigned short ValidX;		//水平有效使用点
	unsigned short ValidY;		//垂直有效使用点
	
	DisplayConfDef	WinConf	=	sAmpLcd.Display.WinConf;			//显示配置
	DisplayInfoDef	WinInfo	=	sAmpLcd.Display.WinInfo;
	
	
	//==========================================显示区域
	ValidX	=	WinInfo.ValidX;
	ValidY	=	WinInfo.ValidY;

	
	//==========================================设置名称信息
	size	=	WinConf.WinNameFtSize/2;
	len		=	DisplayData.LenName;
	//------------------------------------------计算一行可以显示多少个字符	
	coux	=	ValidX/size;		//(宽度为半个高度)
	//------------------------------------------计算占用行数：不足一行算一行(名称和别名)
	if(0!=len%coux)		//有不足行数据
	{
		couy=len/coux+1;
	}
	else	//完整行
	{
		couy=len/coux;
	}
	//------------------------------------------商品名最多显示四行
	if(couy>4)
		couy=4;
	
	WinInfo.LineCoName	=	coux;
	WinInfo.RowCoName		=	couy;
	
	ysum+=	couy*WinConf.WinNameFtSize;
	//==========================================设置别名信息
	size	=	WinConf.WinByNameFtSize/2;
	len		=	DisplayData.LenByName;
	//------------------------------------------计算一行可以显示多少个字符	
	coux	=	ValidX/size;		//(宽度为半个高度)
	//------------------------------------------计算占用行数：不足一行算一行(名称和别名)
	if(0!=len%coux)		//有不足行数据
	{
		couy=len/coux+1;
	}
	else	//完整行
	{
		couy=len/coux;
	}
	//------------------------------------------商品名最多显示四行
	if(couy>4)
		couy=4;
	
	WinInfo.LineCoByName	=	coux;
	WinInfo.RowCoByName		=	couy;
	
