wegam/STM32F1xWorkSpace/Examples/WOW/AMPLCDV11.C
	ysum+=	couy*WinConf.WinByNameFtSize;
	
	//==========================================设置数量信息
	size	=	WinConf.WinNumFtSize/2;
	len		=	DisplayData.LenNum+DisplayData.LenUnit;
	//------------------------------------------计算一行可以显示多少个字符	
	coux	=	ValidX/size;		//(宽度为半个高度)
	//------------------------------------------计算占用行数：不足一行算一行(数量和单位)
	if(0!=len)		//有不足行数据
	{
		coux=1;
		couy=1;
	}
	else
	{
		coux=0;
		couy=0;
	}

	WinInfo.LineCoNum	=	coux;
	WinInfo.RowCoNum	=	couy;
	
	//------------------------------------------单位占用有效行点数
	ValidX	=	ValidX-size*len;
	
	//==========================================设置规格信息
	size	=	WinConf.WinSpecFtSize/2;
	len		=	DisplayData.LenSpec;
	//------------------------------------------计算一行可以显示多少个字符	
	coux	=	ValidX/size;		//(宽度为半个高度)
	//------------------------------------------计算占用行数：不足一行算一行
	if(0!=len%coux)		//有不足行数据
	{
		couy=len/coux+1;
	}
	else	//完整行
	{
		couy=len/coux;
	}
	//------------------------------------------商品名最多显示四行
	if(couy>4)
		couy=4;
	
	WinInfo.LineCoSpec	=	coux;
	WinInfo.RowCoSpec		=	couy;
	
	ysum+=	couy*WinConf.WinSpecFtSize;
	
	//==========================================设置厂家信息
	size	=	WinConf.WinVenderFtSize/2;
	len		=	DisplayData.LenVender;
	//------------------------------------------计算一行可以显示多少个字符	
	coux	=	ValidX/size;		//(宽度为半个高度)
	//------------------------------------------计算占用行数：不足一行算一行
	if(0!=len%coux)		//有不足行数据
	{
		couy=len/coux+1;
	}
	else	//完整行
	{
		couy=len/coux;
	}
	//------------------------------------------商品名最多显示四行
	if(couy>4)
		couy=4;
	
	WinInfo.LineCoVender	=	coux;
	WinInfo.RowCoVender		=	couy;
	
	ysum+=	couy*WinConf.WinVenderFtSize;
	
	//==========================================设置编号信息
	size	=	WinConf.WinCodeFtSize/2;
	len		=	DisplayData.LenCode;
	//------------------------------------------计算一行可以显示多少个字符	
	coux	=	ValidX/size;		//(宽度为半个高度)
	//------------------------------------------计算占用行数：不足一行算一行
	if(0!=len%coux)		//有不足行数据
	{
		couy=len/coux+1;
	}
	else	//完整行
	{
		couy=len/coux;
	}
	//------------------------------------------商品名最多显示四行
	if(couy>4)
		couy=4;
	
	WinInfo.LineCoCode	=	coux;
	WinInfo.RowCoCode		=	couy;
	
	ysum+=	couy*WinConf.WinCodeFtSize;
	
	//==========================================设置起始点信息
	//------------------------------------------计算总共需垂直点数
	ys		=	WinConf.WinTopStartY+WinConf.WinTitleSize+WinConf.WinSeparWidth;	//第一行Y起始点
	temp	=	ys	+	ValidY/2	+	WinConf.WinSeparWidth;													//第二行显示起始Y点---中间分隔符为两个
	if(1==sAmpLcd.Display.DisplaySerial)
	{
		WinInfo.StartY	=	ys;
	}
	else if(WinInfo.StartY>temp)			//换页
	{
		WinInfo.StartY	=	ys;
	}
	else
	{
		//----------------------------------------
		if(ysum>(ValidY/2+WinConf.WinSeparWidth))		//超过半页
		{
			WinInfo.StartY	=	ys;
		}
		else if(WinInfo.StartY>ys)	//已有显示
			WinInfo.StartY	=	temp-1;
		else
			WinInfo.StartY	=	ys;			//初始数据
	}	
	//==========================================
	sAmpLcd.Display.WinInfo	=	WinInfo;
	
	//==========================================清除页
	xs	=	WinConf.WinStartX;
	xe	=	WinConf.WinEndX;
	
	
	ys	=	WinInfo.StartY;	
	
	if(ysum>ValidY/2)
	{
		ye	=	ys+ValidY;
	}
	else
	{
		ye	=	ys+ValidY/2-WinConf.WinSeparWidth*2;
	}		
	
	ST7789V_Fill(xs,ys,xe,ye,WinConf.WinBackColor);
	
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayName(const DisplayDataDef DisplayData)
{
	unsigned char i	=	0;
	unsigned char len=0;
	unsigned char num=0;
	unsigned char size=0;
	unsigned char offset=0;
	unsigned char	buffer[256];
	unsigned char* str;

	unsigned short xs=0;
	unsigned short ys=0;
	unsigned short xe=0;
	unsigned short ye=0;
	unsigned short ysum=0;
	unsigned short yebac=0;
	unsigned short ValidX;		//水平有效使用点
	unsigned short ValidY;		//垂直有效使用点
	
	unsigned short BackColor;	//背景色
	unsigned short PenColor;	//画笔色
	unsigned short FontSize;	//字体大小
	
	
	//unsigned short DisplayNewStartY;
	
	
	DisplayConfDef	WinConf	=	sAmpLcd.Display.WinConf;			//显示配置
	DisplayInfoDef	WinInfo	=	sAmpLcd.Display.WinInfo;
	
	BackColor	=	WinConf.WinNameBkColor;
	PenColor	=	WinConf.WinNameFtColor;
	FontSize	=	WinConf.WinNameFtSize;
	
	//-----------------------------------------------------检查有无数据
	len=DisplayData.LenName;	
	if(0==len)
	{
		return;
	}
	//-----------------------------------------------------获取显示数据
	len			=	DisplayData.LenName;
	offset	=	DisplayData.OffsetName;	
	memcpy(buffer,&DisplayData.String[offset],len);	
	//-----------------------------------------------------清空显示区域
	xs	=	WinConf.WinStartX;	
	xe	=	WinConf.WinEndX;
	
	ys	=	WinInfo.StartY;	
	ye	=	ys+FontSize*WinInfo.RowCoName;
	
	ST7789V_Fill(xs,ys,xe,ye,BackColor);
	
	StartDisplay:
	//-----------------------------------------------------获取显示区域(如果是单行则居中显示)
	if((len*FontSize/2)<WinInfo.ValidX)
	{
		xs	=	WinConf.WinStartX+((WinInfo.ValidX-(len*FontSize/2))/2);
	}
	else
	{
		xs	=	WinConf.WinStartX;
	}		
	xe	=	WinConf.WinEndX;
	
	ys	=	WinInfo.StartY;	
	ye	=	ys+FontSize*WinInfo.RowCoName;
	//-----------------------------------------------------显示数据
	ST7789V_ShowStringBKAre(xs,ys,xe,ye,FontSize,BackColor,PenColor,len,buffer);	//带背景色限定区域显示
	
	WinInfo.StartY=ye;
	
	sAmpLcd.Display.WinInfo	=	WinInfo;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayByName(const DisplayDataDef DisplayData)
{
	unsigned char i	=	0;
	unsigned char len=0;
	unsigned char num=0;
	unsigned char size=0;
	unsigned char offset=0;
	unsigned char	buffer[256];
	unsigned char str[]	=	"别名:";
	unsigned char	strl;

	unsigned short xs=0;
	unsigned short ys=0;
	unsigned short xe=0;
	unsigned short ye=0;
	unsigned short ysum=0;
	unsigned short yebac=0;
	unsigned short ValidX;		//水平有效使用点
	unsigned short ValidY;		//垂直有效使用点
	
	unsigned short BackColor;	//背景色
	unsigned short PenColor;	//画笔色
	unsigned short FontSize;	//字体大小
	
	
