wegam/STM32F1xWorkSpace/Examples/WOW/AMPLCDV11.C
	DisplayConfDef	WinConf	=	sAmpLcd.Display.WinConf;			//显示配置
	DisplayInfoDef	WinInfo	=	sAmpLcd.Display.WinInfo;
	
	BackColor	=	WinConf.WinByNameBkColor;
	PenColor	=	WinConf.WinByNameFtColor;
	FontSize	=	WinConf.WinByNameFtSize;
	
	//-----------------------------------------------------检查有无数据
	len=DisplayData.LenByName;	
	if(0==len)
	{
		return;
	}
	//-----------------------------------------------------获取显示数据
	len			=	DisplayData.LenByName;
	offset	=	DisplayData.OffsetByName;	
	memcpy(buffer,&DisplayData.String[offset],len);	
	
	//-----------------------------------------------------获取显示区域
	strl	=	strlen(str);	
	memcpy(buffer,str,strl);
	offset	=	DisplayData.OffsetByName;
	
	len	=	DisplayData.LenByName;
	memcpy(&buffer[strl],&DisplayData.String[offset],len);
	
	len+=strl;
	
	//-----------------------------------------------------清空显示区域
	xs	=	WinConf.WinStartX;	
	xe	=	WinConf.WinEndX;
	
	ys	=	WinInfo.StartY;	
	ye	=	ys+FontSize*WinInfo.RowCoByName;
	
	ST7789V_Fill(xs,ys,xe,ye,BackColor);
	
	StartDisplay:
	//-----------------------------------------------------显示数据
	ST7789V_ShowStringBKAre(xs,ys,xe,ye,FontSize,BackColor,PenColor,len,buffer);	//带背景色限定区域显示
	
	WinInfo.StartY=ye;
	
	sAmpLcd.Display.WinInfo	=	WinInfo;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayVender(const DisplayDataDef DisplayData)
{
	unsigned char i	=	0;
	unsigned char len=0;
	unsigned char num=0;
	unsigned char size=0;
	unsigned char offset=0;
	unsigned char	buffer[256];
	unsigned char str[]	=	"厂家:";
	unsigned char	strl;

	unsigned short xs=0;
	unsigned short ys=0;
	unsigned short xe=0;
	unsigned short ye=0;
	unsigned short ysum=0;
	unsigned short yebac=0;
	unsigned short ValidX;		//水平有效使用点
	unsigned short ValidY;		//垂直有效使用点
	
	unsigned short BackColor;	//背景色
	unsigned short PenColor;	//画笔色
	unsigned short FontSize;	//字体大小
	

	
	
	DisplayConfDef	WinConf	=	sAmpLcd.Display.WinConf;			//显示配置
	DisplayInfoDef	WinInfo	=	sAmpLcd.Display.WinInfo;
	
	BackColor	=	WinConf.WinVenderBkColor;
	PenColor	=	WinConf.WinVenderFtColor;
	FontSize	=	WinConf.WinVenderFtSize;
	//-----------------------------------------------------检查有无数据
	len=DisplayData.LenVender;	
	if(0==len)
	{
		return;
	}	
	
	//-----------------------------------------------------获取显示区域
	strl	=	strlen(str);	
	memcpy(buffer,str,strl);
	offset	=	DisplayData.OffsetVender;
	
	len	=	DisplayData.LenVender;
	memcpy(&buffer[strl],&DisplayData.String[offset],len);
	
	len+=strl;
	
	goto StartDisplayVender;
	
	//==========================================判断起始点在中线上还是下
	//==========================================开始显示商品名称
	StartDisplayVender:
	
	xs	=	WinConf.WinStartX;
	xe	=	xs+FontSize*WinInfo.LineCoVender/2;
	
	ys	=	WinInfo.StartY;
	
	if(0!=len%WinInfo.LineCoVender)
	{
		ye	=	ys+FontSize*(len/WinInfo.LineCoVender+1);
	}
	else
	{
		ye	=	ys+FontSize*WinInfo.RowCoVender;
	}	
	//-----------------------------------------------------背景填充
	ST7789V_Fill(xs,ys,xe,ye,BackColor);
	//-----------------------------------------------------显示数据
	ST7789V_ShowStringBKAre(xs,ys,xe,ye,FontSize,BackColor,PenColor,len,buffer);	//带背景色限定区域显示
	
	WinInfo.StartY=ye;
	
	sAmpLcd.Display.WinInfo	=	WinInfo;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplaySpec(const DisplayDataDef DisplayData)
{
	unsigned char i	=	0;
	unsigned char len=0;
	unsigned char num=0;
	unsigned char size=0;
	unsigned char offset=0;
	unsigned char	buffer[256];
	unsigned char str[]	=	"规格:";
	unsigned char	strl;

	unsigned short xs=0;
	unsigned short ys=0;
	unsigned short xe=0;
	unsigned short ye=0;
	unsigned short ysum=0;
	unsigned short yebac=0;
	unsigned short ValidX;		//水平有效使用点
	unsigned short ValidY;		//垂直有效使用点
	
	unsigned short BackColor;	//背景色
	unsigned short PenColor;	//画笔色
	unsigned short FontSize;	//字体大小
	

	
	
	DisplayConfDef	WinConf	=	sAmpLcd.Display.WinConf;			//显示配置
	DisplayInfoDef	WinInfo	=	sAmpLcd.Display.WinInfo;
	
	BackColor	=	WinConf.WinSpecBkColor;
	PenColor	=	WinConf.WinSpecFtColor;
	FontSize	=	WinConf.WinSpecFtSize;
	//-----------------------------------------------------检查有无数据
	len=DisplayData.LenSpec;	
	if(0==len)
	{
		return;
	}
	
	//-----------------------------------------------------获取显示区域	
	//len			=	WinInfo.LineCoSpec*WinInfo.RowCoSpec;
	len=DisplayData.LenSpec;

	strl	=	strlen(str);	
	memcpy(buffer,str,strl);
	offset	=	DisplayData.OffsetSpec;
	
	memcpy(&buffer[strl],&DisplayData.String[offset],len);
	
	len+=strl;
	
	goto StartDisplaySpec;
	
	//==========================================判断起始点在中线上还是下
	//==========================================开始显示商品名称
	StartDisplaySpec:
	
	xs	=	WinConf.WinStartX;
	xe	=	xs+FontSize*WinInfo.LineCoSpec/2;
	
	ys	=	WinInfo.StartY;
	
	if(0!=len%WinInfo.LineCoSpec)
	{
		ye	=	ys+FontSize*(len/WinInfo.LineCoSpec+1);
	}
	else
	{
		ye	=	ys+FontSize*WinInfo.RowCoSpec;
	}	
	//-----------------------------------------------------背景填充
	ST7789V_Fill(xs,ys,xe,ye,BackColor);
	//-----------------------------------------------------显示数据
	ST7789V_ShowStringBKAre(xs,ys,xe,ye,FontSize,BackColor,PenColor,len,buffer);	//带背景色限定区域显示
	
	WinInfo.StartY=ye;
	
	sAmpLcd.Display.WinInfo	=	WinInfo;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayCode(const DisplayDataDef DisplayData)
{
	unsigned char i	=	0;
	unsigned char len=0;
	unsigned char num=0;
	unsigned char size=0;
	unsigned char offset=0;
	unsigned char	buffer[256];
	unsigned char str[]	=	"编码:";
	unsigned char	strl;

	unsigned short xs=0;
	unsigned short ys=0;
	unsigned short xe=0;
	unsigned short ye=0;
	unsigned short ysum=0;
	unsigned short yebac=0;
	unsigned short ValidX;		//水平有效使用点
	unsigned short ValidY;		//垂直有效使用点
	
