wegam/STM32F1xWorkSpace/Examples/WOW/AMPLCDV11.C
	unsigned short BackColor;	//背景色
	unsigned short PenColor;	//画笔色
	unsigned short FontSize;	//字体大小
	

	
	
	DisplayConfDef	WinConf	=	sAmpLcd.Display.WinConf;			//显示配置
	DisplayInfoDef	WinInfo	=	sAmpLcd.Display.WinInfo;
	
	BackColor	=	WinConf.WinCodeBkColor;
	PenColor	=	WinConf.WinCodeFtColor;
	FontSize	=	WinConf.WinCodeFtSize;
	
	//-----------------------------------------------------检查有无数据
	len=DisplayData.LenCode;	
	if(0==len)
	{
		return;
	}
	//-----------------------------------------------------获取显示区域	
	len			=	WinInfo.LineCoCode*WinInfo.RowCoCode;
	if(DisplayData.LenSpec<len)
	{
		len=DisplayData.LenCode;
	}
	strl	=	strlen(str);	
	memcpy(buffer,str,strl);
	offset	=	DisplayData.OffsetCode;
	
	memcpy(&buffer[strl],&DisplayData.String[offset],len);
	
	len+=strl;
	
	goto StartDisplay;
	
	//==========================================判断起始点在中线上还是下
	//==========================================开始显示商品名称
	StartDisplay:
	
	xs	=	WinConf.WinStartX;
	xe	=	xs+FontSize*WinInfo.LineCoCode/2;
	
	ys	=	WinInfo.StartY;
	
	if(0!=len%WinInfo.LineCoCode)
	{
		ye	=	ys+FontSize*(len/WinInfo.LineCoCode+1);
	}
	else
	{
		ye	=	ys+FontSize*WinInfo.RowCoCode;
	}	
	//-----------------------------------------------------背景填充
	ST7789V_Fill(xs,ys,xe,ye,BackColor);
	//-----------------------------------------------------显示数据
	ST7789V_ShowStringBKAre(xs,ys,xe,ye,FontSize,BackColor,PenColor,len,buffer);	//带背景色限定区域显示
	
	WinInfo.StartY=ye;
	
	sAmpLcd.Display.WinInfo	=	WinInfo;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DisplayNumber(const DisplayDataDef DisplayData)
{
	unsigned char i	=	0;
	unsigned char len=0;
	unsigned char num=0;
	unsigned char size=0;
	unsigned char offset=0;
	unsigned char	buffer[256];
	unsigned char* str;
	unsigned char	strl;

	unsigned short xs=0;
	unsigned short ys=0;
	unsigned short xe=0;
	unsigned short ye=0;
	unsigned short ysum=0;
	unsigned short yebac=0;
	unsigned short ValidX;		//水平有效使用点
	unsigned short ValidY;		//垂直有效使用点
	
	unsigned short BackColor;	//背景色
	unsigned short PenColor;	//画笔色
	unsigned short FontSize;	//字体大小
	

	
	
	DisplayConfDef	WinConf	=	sAmpLcd.Display.WinConf;			//显示配置
	DisplayInfoDef	WinInfo	=	sAmpLcd.Display.WinInfo;
	
	BackColor	=	WinConf.WinNumBkColor;
	PenColor	=	WinConf.WinNumFtColor;
	FontSize	=	WinConf.WinNumFtSize;
	//DisplayNewStartY	=	sAmpLcd.Display.DisplayNextStartY;	
	
	//-----------------------------------------------------获取显示区域
	str	=	buffer;	
	len=DisplayData.LenNum;
	offset	=	DisplayData.OffsetNum;	
	memcpy(str,&DisplayData.String[offset],len);
	
	str	=	&buffer[len];	
	len	=	DisplayData.LenUnit;
	offset	=	DisplayData.OffsetUnit;
	memcpy(str,&DisplayData.String[offset],len);

	goto StartDisplay;
	
	//==========================================判断起始点在中线上还是下
	//==========================================开始显示商品名称
	StartDisplay:
	
	len	=	DisplayData.LenNum+DisplayData.LenUnit;
	xs	=	WinConf.WinStartX+(WinInfo.ValidX-len*FontSize/2);
	xe	=	xs+FontSize*len/2;
	
	ys	=	WinInfo.StartY-FontSize;
	ye	=	WinInfo.StartY;
	//-----------------------------------------------------背景填充
	ST7789V_Fill(xs,ys,xe,ye,BackColor);
	//-----------------------------------------------------显示数据
	ST7789V_ShowStringBKAre(xs,ys,xe,ye,FontSize,BackColor,PenColor,len,buffer);	//带背景色限定区域显示
	
	WinInfo.StartY=ye;
	
	sAmpLcd.Display.WinInfo	=	WinInfo;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void SetBackColor(unsigned short BKColor)
{
	if(sAmpLcd.Display.LcdPort.ST7789VBColor	!=	BKColor)
	{
		STM32_FLASH_Write(BackColorStartAddr,(unsigned short*)&BKColor,1);						//从指定地址写入指定长度的数据
		BKColor	=	GetBackColor();
		sAmpLcd.Display.LcdPort.ST7789VBColor=BKColor;
	}	
	ST7789V_Clean(BKColor);	//清除屏幕函数
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
unsigned short GetBackColor(void)
{
	unsigned short BKColor;
	STM32_FLASH_Read(BackColorStartAddr,(unsigned short*)&BKColor,1);							//从指定地址开始读出指定长度的数据
	return	BKColor;
}

/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void HW_Configuration(void)
{
//	SPIDef	*SPI	=	&sAmpLcd.SpiPort;
	sST7789VDef	sST7789V;
	SPIDef			sGT32L32;
	RS485Def		sRS485Port;   //层板接口
	SwitchDef 	sSwitch;			//拔码开关
	
	unsigned short temp;
	
	//-------------------------------------------LCD参数初始化
	sST7789V.HWPort.sBL_PORT				=	GPIOA;
	sST7789V.HWPort.sBL_Pin					=	GPIO_Pin_1;
	
	sST7789V.HWPort.sRD_PORT				=	GPIOD;
	sST7789V.HWPort.sRD_Pin					=	GPIO_Pin_2;	
	
	sST7789V.HWPort.sREST_PORT			=	GPIOA;
	sST7789V.HWPort.sREST_Pin				=	GPIO_Pin_15;
	
	sST7789V.HWPort.sDC_PORT				=	GPIOC;
	sST7789V.HWPort.sDC_Pin					=	GPIO_Pin_11;
	
	sST7789V.HWPort.sWR_PORT				=	GPIOC;
	sST7789V.HWPort.sWR_Pin					=	GPIO_Pin_12;	
	
	sST7789V.HWPort.sCS_PORT				=	GPIOC;
	sST7789V.HWPort.sCS_Pin					=	GPIO_Pin_10;
	
	sST7789V.HWPort.sDATABUS_PORT		=	GPIOB;
	sST7789V.HWPort.sDATABUS_Pin		=	GPIO_Pin_All;	
	
	sST7789V.ST7789VRotate	=	ST7789V_Rotate_90D;		//使用旋转角度
	
	
	temp	=	 GetBackColor();			//背景色
	sST7789V.ST7789VBColor=	temp;
	
	sAmpLcd.Display.LcdPort	=	sST7789V;
	
	ST7789V_Initialize(&sAmpLcd.Display.LcdPort);
	
	//-------------------------------------------字库参数初始化
	sGT32L32.Port.SPIx			=	SPI1;
	sGT32L32.Port.CS_PORT		=	GPIOA;
	sGT32L32.Port.CS_Pin		=	GPIO_Pin_4;
	
