wegam/STM32F1xWorkSpace/Examples/WOW/AMPLCDV11.C
	sGT32L32.Port.CLK_PORT	=	GPIOA;
	sGT32L32.Port.CLK_Pin		=	GPIO_Pin_5;
	
	sGT32L32.Port.MISO_PORT	=	GPIOA;
	sGT32L32.Port.MISO_Pin	=	GPIO_Pin_6;
	
	sGT32L32.Port.MOSI_PORT	=	GPIOA;
	sGT32L32.Port.MOSI_Pin	=	GPIO_Pin_7;	
	sGT32L32.Port.SPI_BaudRatePrescaler_x=SPI_BaudRatePrescaler_2;
	
	sAmpLcd.Display.SpiPort	=	sGT32L32;	
  
  GT32L32_Initialize(&sAmpLcd.Display.SpiPort);				//普通SPI通讯方式配置
	
	//-------------------------------------------层板接口USART1 PA11-RE,PA12-TE
  sRS485Port.USARTx  				= USART1;
  sRS485Port.RS485_CTL_PORT  = GPIOA;
  sRS485Port.RS485_CTL_Pin   = GPIO_Pin_8;
	
	sAmpLcd.Comm.RS485Port	=	sRS485Port;
	
  RS485_DMA_ConfigurationNR			(&sAmpLcd.Comm.RS485Port,19200,gDatasize);	//USART_DMA配置--查询方式，不开中断,配置完默认为接收状态
  GPIO_Configuration_OPP50	(sRS485Port.RS485_CTL_PORT,sRS485Port.RS485_CTL_Pin);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605
  GPIO_ResetBits(sRS485Port.RS485_CTL_PORT,sRS485Port.RS485_CTL_Pin);
	
	//-------------------------------------------拨码开关
	sSwitch.NumOfSW	=	8;
  
  sSwitch.SW1_PORT	=	GPIOC;
  sSwitch.SW1_Pin		=	GPIO_Pin_7;
  
  sSwitch.SW2_PORT	=	GPIOC;
  sSwitch.SW2_Pin		=	GPIO_Pin_6;
  
  sSwitch.SW3_PORT	=	GPIOC;
  sSwitch.SW3_Pin		=	GPIO_Pin_5;
  
  sSwitch.SW4_PORT	=	GPIOC;
  sSwitch.SW4_Pin		=	GPIO_Pin_4;
  
  sSwitch.SW5_PORT	=	GPIOC;
  sSwitch.SW5_Pin		=	GPIO_Pin_3;
  
  sSwitch.SW6_PORT	=	GPIOC;
  sSwitch.SW6_Pin		=	GPIO_Pin_2;
  
  sSwitch.SW7_PORT	=	GPIOC;
  sSwitch.SW7_Pin		=	GPIO_Pin_1;
  
  sSwitch.SW8_PORT	=	GPIOC;
  sSwitch.SW8_Pin		=	GPIO_Pin_0;

	sAmpLcd.sSwitch		=	sSwitch;
	
	SwitchIdInitialize(&sAmpLcd.sSwitch);	
	
	temp	=	SWITCHID_ReadLeft(&sAmpLcd.sSwitch);
  sAmpLcd.Sys.AddrLay=(temp>>4)&0X0F;  	//层地址
  sAmpLcd.Sys.AddrSeg=temp&0x0F;      	//位地址
}
/*******************************************************************************
*函数名			:	DataInitialize
*功能描述		:	数据初始化
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void DataInitialize(void)
{
	//==========================================显示参数初始化
	DisplayConfDef WinConf;
	
	WinConf.WinBackColor			=	DisplayBackColor;
	WinConf.WinFontColor			=	DisplayFontColor;
	
	WinConf.WinNameBkColor		=	DisplayNameBkColor;
	WinConf.WinNameFtColor		=	DisplayNameFtColor;
	WinConf.WinNameFtSize			=	DisplayNameFtSize;
	
	WinConf.WinByNameBkColor	=	DisplayByNameBkColor;
	WinConf.WinByNameFtColor	=	DisplayByNameFtColor;
	WinConf.WinByNameFtSize		=	DisplayByNameFtSize;
	
	WinConf.WinSpecBkColor		=	DisplaySpecBkColor;
	WinConf.WinSpecFtColor		=	DisplaySpecFtColor;
	WinConf.WinSpecFtSize			=	DisplaySpecFtSize;
	
	WinConf.WinNumBkColor			=	DisplayNumBkColor;
	WinConf.WinNumFtColor			=	DisplayNumFtColor;
	WinConf.WinNumFtSize			=	DisplayNumFtSize;
	
	WinConf.WinSerialBkColor	=	DisplaySerialBkColor;
	WinConf.WinSerialFtColor	=	DisplaySerialFtColor;
	WinConf.WinSerialFtSize		=	DisplaySerialFtSize;
	
	WinConf.WinCodeBkColor		=	DisplayCodeBkColor;
	WinConf.WinCodeFtColor		=	DisplayCodeFtColor;
	WinConf.WinCodeFtSize			=	DisplayCodeFtSize;
	
	WinConf.WinVenderBkColor	=	DisplayVenderBkColor;
	WinConf.WinVenderFtColor	=	DisplayVenderFtColor;
	WinConf.WinVenderFtSize		=	DisplayVenderFtSize;
	
	WinConf.WinTitleBkColor		=	DisplayTitleBkColor;
	WinConf.WinTitleFtColor		=	DisplayTitleFtColor;
	WinConf.WinTitleSize			=	DisplayTitleSize;
	
	WinConf.WinSeparBkColor		=	DisplaySeparBkColor;
	WinConf.WinSeparWidth			=	DisplaySeparWidth;
	
	WinConf.WinTopStartY			=	DisplayTopStartY;
	WinConf.WinTopEndY				=	DisplayTopEndY;
	WinConf.WinBotStartY			=	DisplayBotStartY;
	WinConf.WinBotEndY				=	DisplayBotEndY;
	
	WinConf.WinStartX					=	DisplayStartX;
	WinConf.WinEndX						=	DisplayEndX;	
	
	
	sAmpLcd.Display.WinConf		=	WinConf;
	
	//=======================================================根据以上相关参数计算有效显示区域大小
	//==========================================计算显示区域-X
	sAmpLcd.Display.WinInfo.ValidX	=	WinConf.WinEndX-WinConf.WinStartX;
	//==========================================计算显示区域-Y
	sAmpLcd.Display.WinInfo.ValidY	=	WinConf.WinBotStartY-(WinConf.WinTopStartY+WinConf.WinTitleSize+WinConf.WinSeparWidth);
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMPLCDV11GUI(void)
{
	unsigned short xs=0;
	unsigned short ys=0;
	unsigned short xe=ST7789V_V-1;
	unsigned short ye=DisplayTopStartY-1;
	
	ST7789V_Clean(DisplayClrColor);
	ST7789V_Fill(xs,ys,xe,ye,LCD565_RED);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	
	xs	=	0;
	ys	=	ST7789V_H-DisplayTopStartY+2;
	xe	=	ST7789V_V-1;
	ye	=	ST7789V_H-1;
	
	ST7789V_Fill(xs,ys,xe,ye,LCD565_RED);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	
	xs	=	0;
	ys	=	ST7789V_H/2-2;
	xe	=	ST7789V_V-1;
	ye	=	ST7789V_H/2+2;
	
	ST7789V_Fill(xs,ys,xe,ye,LCD565_RED);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	
}
#endif
